---
type: PipeFittingAndAccessoryData
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 12
tags: [revit-api, class]
---

# PipeFittingAndAccessoryData

`Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAllConnectorData | 2014 | `public IList < PipeFittingAndAccessoryConnectorData > GetAllConnectorData ()` |
| Method | GetEntity | 2014 | `public Entity GetEntity ()` |
| Method | GetFamilyInstanceId | 2014 | `public ElementId GetFamilyInstanceId ()` |
| Property | BehaviorType | 2014 | `public int BehaviorType { get ; }` |
| Property | FluidDensity | 2014 | `public double FluidDensity { get ; }` |
| Property | FluidViscosity | 2014 | `public double FluidViscosity { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Origin | 2014 | `public XYZ Origin { get ; }` |
| Property | PartType | 2014 | `public PartType PartType { get ; }` |
| Property | ServerGUID | 2014 | `public Guid ServerGUID { get ; }` |
| Property | SystemClassification | 2014 | `public MEPSystemClassification SystemClassification { get ; }` |